{
  "id": {
    "0": {
      "url": "www.cnbc.com/2019/04/03/chinese-hackers-tricked-teslas-autopilot-into-switching-lanes.html",
      "data": {
        "sm_api_character_count": "1566",
        "sm_api_content_reduced": "61%",
        "sm_api_title": "These Chinese hackers tricked Tesla’s Autopilot into suddenly switching lanes",
        "sm_api_content": "The group of cybersecurity researchers from Keen Security Labs in China placed bright-colored stickers on the road to create a \"Fake lane\" that tricked the self-driving software of a Tesla Model S into veering from the appropriate driving lane into the opposing lane on a test course, where oncoming traffic would be driving in a real-life scenario. In a statement provided to CNBC Make It, a Tesla spokesperson pointed out that in the Keen Security Labs' tests \"The physical environment around the vehicle is artificially altered.\" The Tesla spokesperson added that the vulnerability \"Is not a realistic concern given that a driver can easily override Autopilot at any time by using the steering wheel or brakes and should always be prepared to do so, and can manually operate the windshield wiper settings at all times.\" The group of researchers, who are what is known as ethical or \"White hat\" hackers because their research is meant to improve the security of the products and companies they hack, are actually listed in Tesla's \"Security Researcher Hall of Fame\" on the electric automaker's website. In the past, Keen Security Labs has taken part in the \"Bug bounty program\" that Tesla launched in 2014, and which currently offers rewards of up to $15,000 to hackers who make Tesla aware of any potential vulnerabilities in the company's software and other products. Recently, Tesla even awarded a Model 3 car to a pair of hackers who exposed a security bug in the Tesla vehicle that allowed them to take control of the car's internal web browser.",
        "sm_api_limitation": "Waited 0 extra seconds due to API Free mode, 72 requests left to make for today."
      }
    },
    "1": {
      "url": "www.wralsportsfan.com/north-carolina-selected-for-military-bowl-tar-heels-will-face-temple-on-dec-27/18820272/",
      "data": {
        "sm_api_character_count": "1044",
        "sm_api_content_reduced": "41%",
        "sm_api_title": "North Carolina selected for Military Bowl; Tar Heels will face Temple on Dec. 27",
        "sm_api_content": "Chapel Hill, N.C. - The North Carolina football program has been selected to play in the Military Bowl presented by Northrop Grumman against Temple, the game's selection committee announced Sunday. This will be the 34th bowl game in Carolina football's history and its first since 2016. The Military Bowl is scheduled for Friday, Dec. 27 with kickoff scheduled for noon at Navy-Marine Corps Memorial Stadium in Annapolis, Md. The game is scheduled to air on ESPN. This will be Carolina football's first trip to the Military Bowl and its first game against Temple. Under the guidance of offensive coordinator Phil Longo, the offense posted 469 yards per game, which ranked 14th nationally, while scoring 31.3 points per game. Coached by Rod Carey, Temple ranked third in the AAC in total defense, allowing 364.8 yards per game, while posting 3.25 sacks per game and 7.8 TFL. The Owls' offense ranked eighth in the conference, tallying 402 yards per game.",
        "sm_api_limitation": "Waited 0 extra seconds due to API Free mode, 69 requests left to make for today."
      }
    },
    "2": {
      "url": "www.carbuzz.com/news/new-corvette-delayed-for-another-v8-loving-country",
      "data": {
        "sm_api_character_count": "836",
        "sm_api_content_reduced": "27%",
        "sm_api_title": "New Corvette Delayed For Another V8-Loving Country",
        "sm_api_content": "Eventually, the new Corvette convertible could be made available. Given that these right-hand-drive Corvettes are delayed, what does this mean for other right-hand-drive markets, such as the UK and Japan? Interestingly, GM has yet to confirm whether or not the new Corvette will even be sold in any other right-hand-drive market other than Australia. We do know the Corvette will be available in Saudi Arabia and perhaps China, but those countries are left-hand-drive. Whenever in 2021 the new Corvette arrives in the land Down Under, it's projected to carry a base price of around $150,000 AUD, about $102,605 USD at current exchange rates. That's roughly about the same price as a US market fully-loaded 2020 Corvette with the same trim and equipment package, which came to $105,640 when we played around with the official online configurator.",
        "sm_api_limitation": "Waited 0 extra seconds due to API Free mode, 52 requests left to make for today."
      }
    },
    "3": {
      "url": "www.cnbc.com/2019/12/03/tips-for-minimizing-flight-shame-guilt.html",
      "data": {
        "sm_api_character_count": "1120",
        "sm_api_content_reduced": "78%",
        "sm_api_title": "Here’s how to ditch that ‘flight shame’ guilt",
        "sm_api_content": "The concept aims to get people to stop traveling by plane in order to lower carbon emissions and has gained momentum thanks to environmental activists like Greta Thunberg, who opted to travel by boat instead of flying across the Atlantic to attend a United Nations zero emissions summit in August. Investment bank Citi has also warned that \"Flight shaming\" could result in a slowdown in air travel as people look to reduce their carbon footprint. Swapping single-use plastics for a reusable cup or bottle, a metal or bamboo straw, as well as carrying a fabric bag and even a portable water purifier while travelling, is a suggestion James Thornton, CEO of adventure travel company Intrepid Travel, makes for lowering your carbon footprint. If you simply cannot avoid taking a flight due to long-haul travel, David Armstong, CEO of U.K.-based travel search platform HolidayPirates, recommends taking a direct flight as the biggest carbon emissions occur when a plane takes off and lands. Equally Thornton suggests taking the time to research which airlines or travel companies have a carbon offsetting program.",
        "sm_api_limitation": "Waited 0 extra seconds due to API Free mode, 42 requests left to make for today."
      }
    },
    "4": {
      "url": "www.roadandtrack.com/car-culture/a29821408/0030-0031-ode-to-the-burnout-november-2019/",
      "data": {
        "sm_api_character_count": "570",
        "sm_api_content_reduced": "84%",
        "sm_api_title": "Burnout Love Letter From a 2020 C8 Mid-Engine Corvette",
        "sm_api_content": "Spend a week in the world's most spectacular cars. Sports cars are wrapped up in the quandaries of personal freedom more than any other vehicle on four wheels, in pushing the bounds of legally and socially acceptable behavior. Modern life is increasingly a series of confined boxes, and a sports car fits in none of them. If you sat down and designed a sports car by bullet point, listing necessary functions on a spreadsheet, a burnout would be last on the list. The car performed a perfect pirouette, that pushrod small-block screaming at the sky while the tires went to vapor.",
        "sm_api_limitation": "Waited 0 extra seconds due to API Free mode, 94 requests left to make for today."
      }
    },
    "5": {
      "url": "www.dailytarheel.com/article/2015/11/computer-science-professor-opens-tab-for-students-during-class-at-topo",
      "data": {
        "sm_api_character_count": "579",
        "sm_api_content_reduced": "67%",
        "sm_api_title": "Computer science professor opens tab for students during class at TOPO",
        "sm_api_content": "In total, the students generated a tab of about $500, all of which Mayer-Patel paid. Despite the novelty of the event, the class still got work done. Zachary Kaplan, a senior computer science and mathematics double major, said he enjoyed the relaxed atmosphere of the class meeting. Students applauded the unconventional class meeting for providing them the opportunity to talk one-on-one with their professor and fellow students in a fun environment. Patrick Hahn, a senior computer science and mathematical decision sciences double major, said the class period was weird, but hilarious.",
        "sm_api_limitation": "Waited 0 extra seconds due to API Free mode, 87 requests left to make for today."
      }
    },
    "6": {
      "url": "www.computerworld.com/article/2488732/the-wrath-of-koh--samsung-gets-judge-s-ire-in-apple-patent-case.html",
      "data": {
        "sm_api_character_count": "1002",
        "sm_api_content_reduced": "69%",
        "sm_api_title": "The wrath of Koh: Samsung gets judge's ire in Apple patent case",
        "sm_api_content": "The meaning of things like an \"Analyzer server\" and \"Action processor\" hadn't been an issue in the case until Friday, when the U.S. Court of Appeals for the Federal Circuit published a decision related to a case between Apple and Motorola. The specific definitions provided by the appeals court prompted Koh to allow Apple and Samsung to each present an hour of additional testimony on Monday morning. Apple expert witness Todd Mowry, a computer science professor at Carnegie Mellon University, told jurors that the specific definitions from the appeals court hadn't changed his assertion that Samsung had infringed the patent - hardly a surprise. \"Point me to the paragraph Sir, you just testified. Where is it?,\" Koh said while Samsung lawyers scrambled to find previous testimony that backed up their claim. Koh accused Samsung of deliberately taking a vague stance on the definition of terms such as \"Analyzer server\" because it was not clear how the appeals court would rule.",
        "sm_api_limitation": "Waited 0 extra seconds due to API Free mode, 84 requests left to make for today."
      }
    },
    "7": {
      "url": "www.computerworld.com/article/3489343/microsoft-begins-windows-10s-1809-to-1909-compulsory-upgrade.html",
      "data": {
        "sm_api_character_count": "1069",
        "sm_api_content_reduced": "70%",
        "sm_api_title": "Microsoft begins Windows 10's 1809-to-1909 compulsory upgrade",
        "sm_api_content": "Microsoft has begun forcibly upgrading Windows 10 PCs running version 1809 with the latest, the November 2019 Update, aka 1909, which the company launched less than a month ago. \"We will slowly start the phased process to automatically initiate a feature update for devices running the October 2018 Update Home and Pro editions,\" Microsoft said in a Dec. 5 message on Windows 10 1909's page of the Windows Release Health Dashboard. The company said that those running Windows 10 Home, as well as users running unmanaged devices powered by Windows 10 Pro, would be able to decide when to upgrade from one version of the operating system to another using a \"Download and install now\" option. Those Windows 10 Home and Windows 10 Pro users who were at the front of the 1809 distribution line would also be the most likely to get 1909 off the bat. Users can retrieve and install Windows 10 1909 on their own schedule at any time - they don't have to wait for Microsoft to do it for them - by following the steps outlined in this Nov. 12 post to a Microsoft blog.",
        "sm_api_limitation": "Waited 0 extra seconds due to API Free mode, 81 requests left to make for today."
      }
    },
    "8": {
      "url": "www.businessinsider.com/video-elon-musk-hits-traffic-sign-tesla-cybertruck-malibu-2019-12",
      "data": {
        "sm_api_character_count": "593",
        "sm_api_content_reduced": "53%",
        "sm_api_title": "Video: Elon Musk hits traffic sign in Tesla Cybertruck leaving Nobu",
        "sm_api_content": "Elon Musk took Tesla's new Cybertruck out for a spin in Los Angeles on Saturday. During his drive, he took out a traffic pylon and made some other questionable driving decisions. A video published by TMZ showed the billionaire mowing down a \"Right turn only\" sign while turning left out of Nobu, a sushi restaurant in Malibu. To be sure, the sign did not appear to be on the road and instead seemed to be private traffic management for the restaurant's parking lot, given that the driveway is next to a traffic light. In the video, the light turns green for cross-traffic as Musk exits the parking lot.",
        "sm_api_limitation": "Waited 0 extra seconds due to API Free mode, 99 requests left to make for today."
      }
    }
  }
}